Gateway/ResponseFile/20240502084756573_request.xml

<?xml version="1.0" encoding="utf-16"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" xmlns:at="http://cps.huawei.com/cpsinterface/goa/at" xmlns:goa="http://cps.huawei.com/cpsinterface/goa" >
   <soapenv:Body>
      <tem:ApplyTransactionRequest xmlns:tem="http://tempuri.org/">
        <at:Header>
            <goa:CommandID>CheckInformation</goa:CommandID>
            <goa:Version>1.0</goa:Version>
            <!-- <goa:LoginID>NGOPay_AEP</goa:LoginID> -->
            <goa:LoginID>MFIAPI</goa:LoginID>
            <goa:Password>josMMDZDs4+JuHE+E4eEk2Prs3YAJQ9dfvuQi8tg6QWK7LWtjuljXKH2Btbvt/wi</goa:Password>
            <goa:Timestamp>20220110111810</goa:Timestamp>
            <goa:ConversationID>9AA304WCY1</goa:ConversationID>
            <goa:HeaderExtension>
                <goa:Parameter>
                    <goa:Key>name</goa:Key>
                    <goa:Value>cps</goa:Value>
                </goa:Parameter>
            </goa:HeaderExtension>
        </at:Header>

        <at:Body>
            <at:Parameters>
                <goa:Parameter>
                    <goa:Key>InitiatorID</goa:Key>
                    <goa:Value>069-4191</goa:Value>
                </goa:Parameter>
                <goa:Parameter>
                    <goa:Key>FullName</goa:Key>
                    <goa:Value>SEWEETY KHANOM</goa:Value>
                </goa:Parameter>
                <goa:Parameter>
                    <goa:Key>InquiryType</goa:Key>
                    <goa:Value>01</goa:Value>
                </goa:Parameter>
                <goa:Parameter>
                    <goa:Key>InquiryMode</goa:Key>
                    <goa:Value>02</goa:Value>
                </goa:Parameter>
                <goa:Parameter>
                    <goa:Key>FirstName</goa:Key>
                    <goa:Value>Tanveer</goa:Value>
                </goa:Parameter>
                <goa:Parameter>
                    <goa:Key>InitiatorID</goa:Key>
                    <goa:Value>8801301712997</goa:Value>
                </goa:Parameter>
                 <goa:Parameter>
                    <goa:Key>RequesterMSISDN</goa:Key>
                    <goa:Value>01717116383</goa:Value>
                </goa:Parameter>
                <goa:Parameter>
                    <goa:Key>channelCode</goa:Key>
                    <goa:Value>10</goa:Value>
                </goa:Parameter>
                <goa:Parameter>
                    <goa:Key>LastName</goa:Key>
                    <goa:Value>Ghosh</goa:Value>
                </goa:Parameter>
                <goa:Parameter>
                    <goa:Key>PartnerID</goa:Key>
                    <goa:Value>MFI</goa:Value>
                </goa:Parameter>
                <goa:Parameter>
                    <goa:Key>ChkAmount</goa:Key>
                    <goa:Value>111</goa:Value>
                </goa:Parameter>
                <goa:Parameter>
                    <goa:Key>EndMonth</goa:Key>
                    <goa:Value>20120101</goa:Value>
                </goa:Parameter>
                <goa:Parameter>
                    <goa:Key>ExtendedParmeter1</goa:Key>
                    <goa:Value>Test1</goa:Value>
                </goa:Parameter>
                <goa:Parameter>
                    <goa:Key>SubID</goa:Key>
                    <goa:Value>11111</goa:Value>
                </goa:Parameter>
                <goa:Parameter>
                    <goa:Key>AccountID</goa:Key>
                    <goa:Value>069-2930</goa:Value>
                </goa:Parameter>
                <goa:Parameter>
                    <goa:Key>StartMonth</goa:Key>
                    <goa:Value>20120101</goa:Value>
                </goa:Parameter>
            </at:Parameters>
         </at:Body>

      </tem:ApplyTransactionRequest>
   </soapenv:Body>
</soapenv:Envelope>